{
  "movies": [{
    "title" : "Harry Potter and the Philosopher's Stone",
    "movie_number" : "1",
    "main_characters" : ["Harry Potter", "Ron Weasley", "Hermione Granger", "Rubeus Hagrid", "Neville Longbottom", "Draco Malfoy", "Albus Dumbledore", "Professor McGonagall", "Professor Snape", "Professor Quirrell", "Lord Voldemort"],
    "description" : "Adaptation of the first of J.K. Rowling's popular children's novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents' mysterious deaths.",
    "poster" : "harry_potter_movie_1_poster.png",
    "hero_image" : "harry_potter_movie_1_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Chamber of Secrets",
    "movie_number" : "2",
    "main_characters" : ["Harry Potter", "Ron Weasley", "Hermione Granger", "Lucius Malfoy", "Professor Snape", "Professor McGonagall", "Hagrid The Giant", "Albus Dumbledore", "Draco Malfoy", "Lord Voldemort"],
    "description" : "The follow-up to \"Harry Potter and the Sorcerer's Stone\" finds young wizard Harry Potter (Daniel Radcliffe) and his friends, Ron (Rupert Grint) and Hermione (Emma Watson), facing new challenges during their second year at Hogwarts School of Witchcraft and Wizardry as they try to discover a dark force that is terrorizing the school.",
    "poster" : "harry_potter_movie_2_poster.png",
    "hero_image" : "harry_potter_movie_2_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Prisoner of Azkaban",
    "movie_number" : "3",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Sirius Black", "Professor Lupin", "Albus Dumbledore", "Professor Snape", "Lord Voldemort"],
    "description" : "Harry Potter's (Daniel Radcliffe) third year at Hogwarts starts off badly when he learns deranged killer Sirius Black (Gary Oldman) has escaped from Azkaban prison and is bent on murdering the teenage wizard. While Hermione's (Emma Watson) cat torments Ron's (Rupert Grint) sickly rat, causing a rift among the trio, a swarm of nasty Dementors is sent to protect the school from Black. A mysterious new teacher helps Harry learn to defend himself, but what is his secret tie to Sirius Black?",
    "poster" : "harry_potter_movie_3_poster.png",
    "hero_image" : "harry_potter_movie_3_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Goblet of Fire",
    "movie_number" : "4",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Rubeus Hagrid", "Alastor Moody", "Albus Dumbledore"],
    "description" : "The fourth movie in the Harry Potter franchise sees Harry (Daniel Radcliffe) returning for his fourth year at Hogwarts School of Witchcraft and Wizardry, along with his friends, Ron (Rupert Grint) and Hermione (Emma Watson). There is an upcoming tournament between the three major schools of magic, with one participant selected from each school by the Goblet of Fire. When Harry's name is drawn, even though he is not eligible and is a fourth player, he must compete in the dangerous contest.",
    "poster" : "harry_potter_movie_4_poster.png",
    "hero_image" : "harry_potter_movie_4_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Order of the Phoenix",
    "movie_number" : "5",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Rubeus Hagrid", "Draco Malfoy", "Albus Dumbledore", "Dolores Umbridge", "Bellatrix Lestrange", "Lord Voldemort", "Sirius Black", "Vernon Dursley", "Lucius Malfoy"],
    "description" : "Now in his fifth year at Hogwarts, Harry (Daniel Radcliffe) learns that many in the wizarding community do not know the truth of his encounter with Lord Voldemort. Cornelius Fudge, minister of Magic, appoints his toady, Dolores Umbridge, as Defense Against the Dark Arts teacher, for he fears that professor Dumbledore will take his job. But her teaching is deficient and her methods, cruel, so Harry prepares a group of students to defend the school against a rising tide of evil.",
    "poster" : "harry_potter_movie_5_poster.png",
    "hero_image" : "harry_potter_movie_5_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Half-Blood Prince",
    "movie_number" : "6",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Bellatrix Lestrange", "Draco Malfoy", "Albus Dumbledore", "Ginny Weasley", "Horace Slughorn", "Professor Snape"],
    "description" : "As Death Eaters wreak havoc in both Muggle and Wizard worlds, Hogwarts is no longer a safe haven for students. Though Harry (Daniel Radcliffe) suspects there are new dangers lurking within the castle walls, Dumbledore is more intent than ever on preparing the young wizard for the final battle with Voldemort. Meanwhile, teenage hormones run rampant through Hogwarts, presenting a different sort of danger. Love may be in the air, but tragedy looms, and Hogwarts may never be the same again.",
    "poster" : "harry_potter_movie_6_poster.png",
    "hero_image" : "harry_potter_movie_6_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Deathly Hallows – Part 1",
    "movie_number" : "7",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Bellatrix Lestrange", "Rubeus Hagrid", "Lord Voldemort", "Albus Dumbledore", "Vernon Dursley", "Ollivander", "Xenophilius Lovegood", "Lucius Malfoy", "Rufus Scrimgeour", "Professor Snape", "Petunia Dursley", "Wormtail", "Remus Lupin"],
    "description" : "Without the guidance and protection of their professors, Harry (Daniel Radcliffe), Ron (Rupert Grint) and Hermione (Emma Watson) begin a mission to destroy the Horcruxes, the sources of Voldemort's immortality. Though they must rely on one another more than ever, dark forces threaten to tear them apart. Voldemort's Death Eaters have seized control of the Ministry of Magic and Hogwarts, and they are searching for Harry -- even as he and his friends prepare for the ultimate showdown.",
    "poster" : "harry_potter_movie_7_poster.png",
    "hero_image" : "harry_potter_movie_7_hero.jpg"
  },

  {
    "title" : "Harry Potter and the Deathly Hallows – Part 2",
    "movie_number" : "8",
    "main_characters" : ["Harry Potter", "Hermione Granger", "Ron Weasley", "Bellatrix Lestrange", "Rubeus Hagrid", "Lord Voldemort", "Lucius Malfoy", "Professor Snape", "Professor McGonagall", "Remus Lupin"],
    "description" : "A clash between good and evil awaits as young Harry (Daniel Radcliffe), Ron (Rupert Grint) and Hermione (Emma Watson) prepare for a final battle against Lord Voldemort (Ralph Fiennes). Harry has grown into a steely lad on a mission to rid the world of evil. The friends must search for the Horcruxes that keep the dastardly wizard immortal. Harry and Voldemort meet at Hogwarts Castle for an epic showdown where the forces of darkness may finally meet their match.",
    "poster" : "harry_potter_movie_8_poster.png",
    "hero_image" : "harry_potter_movie_8_hero.jpg"
  },

  {
    "title" : "Fantastic Beasts and Where to Find Them",
    "movie_number" : "9",
    "main_characters" : ["Newt Scamander", "Credence", "Percival Graves", "Gnarlack", "Porpentina Goldstein", "Henry Shaw, Sr", "Mary Lou", "Seraphina Picquery", "Jacob Kowalski", "Chastity"],
    "description" : "In 1926, Newt Scamander (Eddie Redmayne) arrives at the Magical Congress of the United States of America (MACUSA), for a meeting with an important official. At this meeting is a magically expanded briefcase which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations. The mistake has a devastating effect on the state of Wizarding/No-Maj (the American term for a non-magical person or muggle) relations in New York City's community of wizards and witches, which is already in a dangerous place, due to the threatening presence of the fanatical New Salem Philanthropic Society, an extremist organisation dedicated to the eradication of wizard-kind. Newt battles to correct the mistake, and the horrors of the resultant increase in violence, fear, and tension felt between magical and non-magical peoples.",
    "poster" : "harry_potter_movie_9_poster.png",
    "hero_image" : "harry_potter_movie_9_hero.jpg"
  }]

}